app/controllers/users_controller.rb

  def index
    @users = User.order(created_at: :desc)
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "address", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)